// let n,
// i = 1;
// while(i <= n) {
//     if (i % 2 == 0) {
//         console.log()
//     }
// }

// 10 удаа  "Hello!" гэж хэвлэх

// let i = 1;
// while (i <= 10) {
//   console.log(i, "Hello!");
//   i++;
// }

// 2. 1-ээс 10 хүртэлх тоог хэвлэх

// let i = 1;
// while (i <= 10) {
//   console.log(i);
//   i++;
// }

// 1-ээс 20 хүртэлх тооны нийлбэр олох
// let i = 1;
// let n = 0;
// while (i <= 20) {
//   n = n + i;
//   console.log(3, n);
//   i++;
// }
// 1-ээс 20 хүртэлх сондгой тоонуудыг хэвлэх

// let i = 1;
// while (i <= 20) {
//   if (i % 2 == 1) console.log(i);
//   i++;
// }

// Дурын тоо өгөгдөхөд тухайн тооны факториал олох
// 4!  = 4 * 3 * 2 * 1

// let i = 1;
// let number = 4;
// let fact = 1;

// while (number > 0) {
//   fact = fact * number;
//   number--;
// }

// console.log(fact);

// let i = 1,
// n = 10,
// m = 1;
// while(i <= 10) {
//     if (i % 2 == 1)
// }

//Тооны хүрд харуулах програм бич.

// let number = 3;
// let i = 1;

// while (i <= 10) {
//   let urjver = number * i;
//   console.log(number, "x", i, "=", urjver);
//   console.log(number + " x " + i + " = " + urjver);
//   i++;
// }
// let n = 213,
//   reversed = "";
// while (n > 0) {
//   let lastDigit = n % 10;
//   reversed = reversed + lastDigit;
//   console.log(n, "--");
//   n = (n - (n % 10)) / 10;
//   console.log(n);
// }
// console.log(reversed);

// "10" + "10" ==> "1010"
// 1. 936-г 12д хуваагаад гарсан хариуг 9д хуваахад гарах үлдэгдлийг хэвлэнэ үү.

// 2. Гараас 0-100 хооронд тоон утга авч тохирох үсгэн тэмдэглэгээгээр онц эсвэл сайн эсэхийг буцаа.
// 3. Сар оруулахад тухайн сар хэд хоногтой болохыг харуул.
// 4. Өгөгдсөн тооны тэгш эсвэл сондгой эсэхийг шалгана уу.
// 5. Өгөгдсөн тооны эерэг тоо эсвэл сөрөг тоо болохыг шалгаад хэвлэж харуулна уу.
// 6. 4 н хувьсагч зарлан тоон утга өг. Өгөгдсөн 4 тооны 80-аас их тоонуудын нийлбэрийг ол.
