
// 1. 936-г 12д хуваагаад гарсан хариуг 9д хуваахад гарах үлдэгдлийг хэвлэнэ үү.
// for(let i = 936; n = 12; m = 936 / 12, c = m % 9 ) { 
//     console.log(1, c)
// }
// 2. Гараас 0-100 хооронд тоон утга авч тохирох үсгэн тэмдэглэгээгээр онц эсвэл сайн эсэхийг буцаа.
// for (let i = 0; i <= 100; i++){
//     if (i === 3) break;
//     console.log("good", i);
// }
// 3. Сар оруулахад тухайн сар хэд хоногтой болохыг харуул.
   // for ( i = 4; i < 5; i++) { 
   //  console.log(3, 30);
   // }  
// 4. Өгөгдсөн тооны тэгш эсвэл сондгой эсэхийг шалгана уу.
// 5. Өгөгдсөн тооны эерэг тоо эсвэл сөрөг тоо болохыг шалгаад хэвлэж харуулна уу.
// 6. 4 н хувьсагч зарлан тоон утга өг. Өгөгдсөн 4 тооны 80-аас их тоонуудын нийлбэрийг ол.

// 1. 10 удаа  "Hello!" гэж хэвлэх
// for (let i = 1; i <= 10; i++) {
// console.log(i, "Hello!");
// }
// 2. 1-ээс 10 хүртэлх тоог хэвлэх
// for (let i = 0,  i <= 10; i++){
//    console.log(i)
// }
// 3. 1-ээс 20 хүртэлх тооны нийлбэр олох
// for (let i = 1, n = 1 ; i < 20; i++, n += i) {
//    console.log(3, n)
// }
// 4. 1-ээс 20 хүртэлх сондгой тоонуудыг хэвлэх
// for (let i = 1; i < 20; i++) {
//    console.log(4, i++)
// }
// 5. Дурын тоо өгөгдөхөд тухайн тооны факториал олох
// for (let i = 1, n = 1, m = n; i < 12; i++, m*=1) {
//    console.log(5, m)
// }
// 6. Тооны хүрд харуулах програм бич.
//   3x1=3
//   3x2=6
//   3x3=9
for (let i = 3, n = 1; i <= 10;   urjver = i * 1, n++) {
   console.log(6, i, "*", n, "=", urjver);

}
// 7. Дурын тоо өгөгдөхөд  тухайн тооны урвууг хэвлэ. Зөвхөн эерэг то байна. Жишээ нь: 123 <=> 321

// Create a while loop that runs from 1-100
// Every 10 loops, print out: Checkpoint! and the loop number
// On loop 50 print out ONLY: Half way there!
// On the final loop (100) print out ONLY: You made it!
// AFTER the loop is done, print out: All, done!
//   You should see this printed out when run:
// Plain Text
// Checkpoint! 10
// Checkpoint! 20
// Checkpoint! 30
// Checkpoint! 40
// Half way there!
// Checkpoint! 60
// Checkpoint! 70
// Checkpoint! 80
// Checkpoint! 90
// You made it!
// All, done!

// 1. Төсвийн хянагч (Budget Tracker)
// Та өдөр тутмын зардлаа хянахыг хүсч байна. Таны төсөв буюу зарцуулах боломжтой мөнгөний хэмжээ $100 байна.
// Ажлын өдрүүдэд (Даваа - Баасан) зардал $10 байх болно.
// Амралтын өдрүүдэд (Бямба, Ням) зардал $25 байх болно.
// Хэрэв  нийт зардал $80-аас илүү, гэхдээ $100-аас бага болвол "Таны нийт зардал 100$ руу ойртож байна шүү" гэж хэвлэ.
// Хэрэв  нийт зардал $100 буюу төсвийн хязгаарт хүрсэн бол: "Та зардлын хязгаарт хүрлээ!" гэж хэвлээд давталтыг зогсоо.

// 2. Кофе шопын урамшууллын карт (Coffee Shop Punch Card)
// Кофе шоп урамшууллын карттай бөгөөд 10 аяга кофе авсны дараа үнэгүй кофе авах боломжтой.
// Худалдан авсан кофены тоогоор ажиллах давталт үүсгээрэй.
// Худалдан авалт бүрт “Та … дахь кофегоо худалдан авлаа”  гэж хэвлэ.
// 3 дахь удаагийн худалдан авалт бүрийн дараа  "Танд үнэгүй бялуу бэлэглжу байна” гэж хэвлэ.
// 10 дахь худалдан авалтанд "Баяр хүргэе! Та үнэгүй кофе авлаа!" гэж хэвлэ.
// Давталт дууссаны дараа: "Урамшууллын карт дууслаа!" гэж хэвлэ.

//  Summing the Digits of a Number with While Loop
// jishee n : 153  uyd hariu 1+5+3 + 4 = 12  bna
// Finding the Largest Digit in a Number Using While Loop
// jishee n: 6023  uyd hariu 6 bna

// 21. 3-37 хүртэлх тоонуудаас 5д хуваагддаг тоонуудыг дарааллуулан хэвлэ
// 23. Өгөгдсөн эерэг тооны тэгш цифрүүдийн үржвэрийг олно уу
// Жишээ нь 4019 үед 4 * 0 == 0
// 26. N тоо өгөгдөнө, Хэрэв N тоо тэгш бол 2-т хуваа эсвэл сондгой бол 3 аар үржиж 1 ийг нэм. Дээрх үйлдлийг N нь 1 тэй тэнцүү болох хүртэл хэдэн удаа давтах вэ.
// 27. Өгөгдсөн эерэг тооны тэгш цифрүүдийн үржвэр болон сондгой цифрүүдийн нийлбэрийн зөрүүг олоорой