// 21. 3-37 хүртэлх тоонуудаас 5д хуваагддаг тоонуудыг дарааллуулан хэвлэ
// let i = 3,
// n;
//  while(i <= 37) {
//     if (i % 5 === 0) {
//         console.log(21, i);
//     }   
//      i++;
//  }

// 23. Өгөгдсөн эерэг тооны тэгш цифрүүдийн үржвэрийг олно уу
// Жишээ нь 4019 үед 4 * 0 == 0

//  let a = 2,
//  b = 4,
//  c = 7,
//  d = 9,
//  multiple = 1;
// if (a % 2 == 0) {
//    multiple *= a
//    if (b % 2 == 0) {
//       multiple *= b
//    } if(c % 2 == 0) {
//       multiple *= c
//    } if (d % 2 == 0) {
//       multiple *= d
//    } console.log(multiple)
// }
    
// 26. N тоо өгөгдөнө, Хэрэв N тоо тэгш бол 2-т хуваа эсвэл сондгой бол 3 аар үржиж 1 ийг нэм.
//  Дээрх үйлдлийг N нь 1 тэй тэнцүү болох хүртэл хэдэн удаа давтах вэ.

// let n = 4,
// div = 1;
// while (n % 2 === 0) {
//     if (n )
// console.log(26, div)
//  i++;
// } 
let n = 2,
a = 0;
if (n % 2 == 0) {
   while(n > 0) {
      n = n /2
      a++
   }
   console.log(a)
} else {
   console.log(n*3+1)
}



// 27. Өгөгдсөн эерэг тооны тэгш цифрүүдийн үржвэр болон сондгой цифрүүдийн нийлбэрийн зөрүүг олоорой
// let i = 2345;


