// 21. 3-37 хүртэлх тоонуудаас 5д хуваагддаг тоонуудыг дарааллуулан хэвлэ
// let i = 3;
// while(i <= 37) {
//     if (i % 5 === 0) {
//         console.log(21, i);
//     } else {console.log(21, i);
        
//     } 
//     i++;
// }

// 23. Өгөгдсөн эерэг тооны тэгш цифрүүдийн үржвэрийг олно уу
// Жишээ нь 4019 үед 4 * 0 == 0

//  let i= 3487
//  a = 4 * 8;
//  if (4 * 8 == a) {
//     console.log(23, "true");
//  } else console.log(23, "false");
    
 

// 26. N тоо өгөгдөнө, Хэрэв N тоо тэгш бол 2-т хуваа эсвэл сондгой бол 3 аар үржиж 1 ийг нэм.
//  Дээрх үйлдлийг N нь 1 тэй тэнцүү болох хүртэл хэдэн удаа давтах вэ.

// let n = 23,
// i = 23 * 3 + 1;
// while(n <= 23) {
//    if (n === 1) 
//     break;
// console.log(26, n);
//  i++;
// } 
// 27. Өгөгдсөн эерэг тооны тэгш цифрүүдийн үржвэр болон сондгой цифрүүдийн нийлбэрийн зөрүүг олоорой
// let i = 2345;


